bdmihai/stm32f411ce-adc/source/app/font.c
/*_____________________________________________________________________________
 │                                                                            |
 │ COPYRIGHT (C) 2020 Mihai Baneu                                             |
 │                                                                            |
 | Permission is hereby  granted,  free of charge,  to any person obtaining a |
 | copy of this software and associated documentation files (the "Software"), |
 | to deal in the Software without restriction,  including without limitation |
 | the rights to  use, copy, modify, merge, publish, distribute,  sublicense, |
 | and/or sell copies  of  the Software, and to permit  persons to  whom  the |
 | Software is furnished to do so, subject to the following conditions:       |
 |                                                                            |
 | The above  copyright notice  and this permission notice  shall be included |
 | in all copies or substantial portions of the Software.                     |
 |                                                                            |
 | THE SOFTWARE IS PROVIDED  "AS IS",  WITHOUT WARRANTY OF ANY KIND,  EXPRESS |
 | OR   IMPLIED,   INCLUDING   BUT   NOT   LIMITED   TO   THE  WARRANTIES  OF |
 | MERCHANTABILITY,  FITNESS FOR  A  PARTICULAR  PURPOSE AND NONINFRINGEMENT. |
 | IN NO  EVENT SHALL  THE AUTHORS  OR  COPYRIGHT  HOLDERS  BE LIABLE FOR ANY |
 | CLAIM, DAMAGES OR OTHER LIABILITY,  WHETHER IN AN ACTION OF CONTRACT, TORT |
 | OR OTHERWISE, ARISING FROM,  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR  |
 | THE USE OR OTHER DEALINGS IN THE SOFTWARE.                                 |
 |____________________________________________________________________________|
 |                                                                            |
 |  Author: Mihai Baneu                           Last modified: 22.Nov.2020  |
 |                                                                            |
 |___________________________________________________________________________*/

/* 
  original code from https://github.com/olikraus/u8g2/

  Copyright (c) 2016, olikraus@gmail.com
  All rights reserved.
  
*/

#include "stm32f4xx.h"

/*
  Fontname: -Adobe-Courier-Bold-R-Normal--25-180-100-100-M-150-ISO10646-1
  Copyright: Copyright (c) 1984, 1987 Adobe Systems Incorporated. All Rights Reserved. Copyright (c) 1988, 1991 Digital Equipment Corporation. All Rights Reserved.
  Glyphs: 95/873
  BBX Build Mode: 3
*/
const uint8_t u8x8_font_courB18_2x3_r[4564] = 
  " ~\2\3\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\370\374\374\370\0\0\0"
  "\0\0\0\0\0\0\0\0\0\1\277\277\1\0\0\0\0\0\0\0\0\0\0\0\0\0\3\3\0\0\0\0"
  "\0\0\0\0\0\0\0<\374<\0<\374<\0\0\0\0\0\0\0\0\0\0\1\0\0\0\1\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\200\200\200\376\376\200\200\376\376\200"
  "\200\0\0\0\0\60\61\361\377\77\61\361\377\77\61\61\1\0\0\0\0\0\0\17\17\0\0\17\17\0\0\0"
  "\0\0\0\0\0\0\340\360\30\30\36\36\60xx\0\0\0\0\0\0\0\341\343\303\206\206\206\206\314\374x"
  "\0\0\0\0\0\0\1\1\0\1\37\37\1\1\0\0\0\0\0\0\0\0`\360\230\10\10\230\360`\0\0"
  "\0\0\0\0\0\0\20\20\31\311\355\65\24\26\62\342\300\0\0\0\0\0\0\0\0\0\1\3\2\2\3\1"
  "\0\0\0\0\0\0\0\300\340\60\60\60p`\0\0\0\0\0\0\0\0\340\371\37\16\34\270\360\360\270\30"
  "\0\0\0\0\0\0\1\3\3\3\3\3\1\1\3\3\3\0\0\0\0\0\0\0\0\370\370\370\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\3\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\340\370\34\14\0\0\0\0\0\0\0\0\0\0\0\377\377\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\7\37\70\60\0\0\0\0\0\0\0\0\14\34\370\340\0\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\377\377\0\0\0\0\0\0\0\0\0\0\0\60\70\37\7\0\0\0\0\0"
  "\0\0\0\0\0\0``\300\300\374\374\300\300``\0\0\0\0\0\0\0\30\36\16\3\3\16\36\30\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\340\340\0\0\0\0"
  "\0\0\0\0\0\14\14\14\14\14\377\377\14\14\14\14\14\0\0\0\0\0\0\0\0\0\1\1\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\200\200\200\0\0\0"
  "\0\0\0\0\0\0\0\0\30\16\7\3\1\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0"
  "\0\0\0\0\0\0\14\14\14\14\14\14\14\14\14\14\14\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\200\200\200\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\3\3\3\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\200\340x\36"
  "\6\0\0\0\0\0\0\0\200\340x\36\7\1\0\0\0\0\0\0\0\0\30\36\7\1\0\0\0\0\0\0"
  "\0\0\0\0\0\0\340\370\30\14\14\14\14\30\370\340\0\0\0\0\0\0\177\377\200\0\0\0\0\200\377\177"
  "\0\0\0\0\0\0\0\1\1\3\3\3\3\1\1\0\0\0\0\0\0\0\30\30\30\34\374\374\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\377\377\0\0\0\0\0\0\0\0\0\0\3\3\3\3\3\3\3\3\3\3"
  "\0\0\0\0\0\0px\34\14\14\14\14\34\370\360\0\0\0\0\0\0\200\300\340p\70\34\16\7\3\1"
  "\0\0\0\0\0\3\3\3\3\3\3\3\3\3\3\3\0\0\0\0\0\0\60\70\34\14\14\14\14\234\370\360"
  "\0\0\0\0\0\300\300\200\0\6\6\6\7\217\375\370\0\0\0\0\0\0\1\3\3\3\3\3\3\3\1\0"
  "\0\0\0\0\0\0\0\0\300\360\70\34\374\374\0\0\0\0\0\0\0\60<\77\63\60\60\60\377\377\60\60"
  "\0\0\0\0\0\0\0\0\0\3\3\3\3\3\3\3\0\0\0\0\0\0\0\374\374\14\214\214\214\214\14\14"
  "\0\0\0\0\0\0\300\303\203\3\1\1\1\203\307\377|\0\0\0\0\0\0\1\3\3\3\3\3\3\1\1"
  "\0\0\0\0\0\0\200\340\360\70\30\34\14\14\14\14\0\0\0\0\0\0\177\377\306\203\3\3\3\207\376\374"
  "\0\0\0\0\0\0\0\1\1\3\3\3\3\3\1\0\0\0\0\0\0\0\34\34\14\14\14\14\14\314\374<"
  "\0\0\0\0\0\0\0\0\0\0\200\360~\17\1\0\0\0\0\0\0\0\0\0\0\0\3\3\0\0\0\0"
  "\0\0\0\0\0\0\360\370\30\14\14\14\14\30\370\360\0\0\0\0\0\0\370\375\217\6\6\6\6\217\375\370"
  "\0\0\0\0\0\0\0\1\3\3\3\3\3\3\1\0\0\0\0\0\0\0\0\340\370\30\14\14\14\14\30\370"
  "\340\0\0\0\0\0\0\7\17\34\30\30\30\214\306\377\77\0\0\0\0\0\0\3\3\3\3\3\3\1\1\0"
  "\0\0\0\0\0\0\0\0\0\200\200\200\0\0\0\0\0\0\0\0\0\0\0\0\0\203\203\203\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\3\3\3\0\0\0\0\0\0\0\0\0\0\0\0\0\200\200\200\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\203\203\203\0\0\0\0\0\0\0\0\0\0\0\30\16\7\3\1\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\200\200\300\300`` \0\0\0\14\14\36\36\63\63aa\300\300\200"
  "\200\0\0\0\0\0\0\0\0\0\0\0\0\0\0\1\1\1\0\0\0\0\0\0\0\0\0\0\0\0\0\0"
  "\0\0\0\0\0\63\63\63\63\63\63\63\63\63\63\63\63\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0"
  "\0\0\0\0\0 ``\300\300\200\200\0\0\0\0\0\0\0\0\0\0\200\200\300\300aa\63\63\36\36"
  "\14\14\0\0\0\1\1\1\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\360\370\30\30\30\30\70\360\340"
  "\0\0\0\0\0\0\0\0\0\0\270\274\14\6\7\3\0\0\0\0\0\0\0\0\0\0\3\3\0\0\0\0"
  "\0\0\0\0\0\0\340\370\30\14\14\214\230\370\340\0\0\0\0\0\0\0\377\377\0\36\77sa\177\177`"
  "\0\0\0\0\0\0\1\7\6\14\14\14\14\6\6\0\0\0\0\0\0\0\30\30\230\370xx\340\200\0\0"
  "\0\0\0\0\0\300\360~\77\63\60\60\63\77~\360\300\0\0\0\3\3\3\3\3\3\0\0\3\3\3\3"
  "\3\3\0\0\0\30\30\370\370\30\30\30\30\30\70\360\340\0\0\0\0\0\0\377\377\6\6\6\6\6\7\217"
  "\375\370\0\0\0\3\3\3\3\3\3\3\3\3\3\3\1\0\0\0\0\200\340\360\60\30\30\30\30\30\60\370"
  "\370\0\0\0\0\77\377\340\200\0\0\0\0\0\0\200\200\0\0\0\0\0\0\1\1\3\3\3\3\3\3\1"
  "\1\0\0\0\30\30\370\370\30\30\30\30\30\30\60\360\340\200\0\0\0\0\377\377\0\0\0\0\0\0\200\300"
  "\377\77\0\0\3\3\3\3\3\3\3\3\3\3\3\1\0\0\0\0\0\30\30\370\370\30\30\30\230\230\30\370"
  "\370\0\0\0\0\0\0\377\377\6\6\6\37\37\0\0\340\340\0\0\0\3\3\3\3\3\3\3\3\3\3\3"
  "\3\3\0\0\0\30\30\370\370\30\30\30\230\230\30\30\370\370\0\0\0\0\0\377\377\6\6\6\37\37\0\0"
  "\0\0\0\0\0\3\3\3\3\3\3\3\3\0\0\0\0\0\0\0\0\200\340\360\60\30\30\30\30\30\30\60"
  "\370\370\0\0\0\77\377\340\200\0\0\0\30\30\30\230\370\370\0\0\0\0\0\1\1\3\3\3\3\3\3\1"
  "\1\0\0\0\30\30\370\370\30\30\0\0\30\30\370\370\30\30\0\0\0\0\377\377\6\6\6\6\6\6\377\377"
  "\0\0\0\0\3\3\3\3\3\3\0\0\3\3\3\3\3\3\0\0\0\0\30\30\30\30\370\370\30\30\30\30"
  "\0\0\0\0\0\0\0\0\0\0\377\377\0\0\0\0\0\0\0\0\0\0\3\3\3\3\3\3\3\3\3\3"
  "\0\0\0\0\0\0\0\0\30\30\30\30\30\370\370\30\30\30\0\0\0\360\360\200\0\0\0\0\200\377\377\0"
  "\0\0\0\0\0\0\1\3\3\3\3\3\3\1\0\0\0\0\0\0\30\30\370\370\30\30\200\300\370x\70\30"
  "\30\0\0\0\0\0\377\377\16\7\17\35\70\360\340\200\0\0\0\0\3\3\3\3\3\3\0\0\0\0\3\3"
  "\3\3\0\0\0\30\30\30\370\370\30\30\30\0\0\0\0\0\0\0\0\0\0\0\377\377\0\0\0\0\0\340"
  "\340\0\0\0\0\3\3\3\3\3\3\3\3\3\3\3\3\0\0\0\30\370\370x\340\200\0\0\200\340x\370"
  "\370\30\0\0\0\377\377\0\3\7\34\34\7\3\0\377\377\0\0\0\3\3\3\3\3\0\0\0\0\3\3\3"
  "\3\3\0\0\0\30\370\370x\340\200\0\0\30\30\370\370\30\0\0\0\0\377\377\0\1\7\36x\340\200\377"
  "\377\0\0\0\0\3\3\3\3\3\0\0\0\1\3\3\3\0\0\0\0\200\340\360\60\30\30\30\30\30\60\360"
  "\340\200\0\0\0\77\377\340\200\0\0\0\0\0\200\340\377\77\0\0\0\0\0\1\1\3\3\3\3\3\1\1"
  "\0\0\0\0\0\30\30\370\370\30\30\30\30\30\30\60\360\340\0\0\0\0\0\377\377\30\30\30\30\30\30\14"
  "\17\7\0\0\0\3\3\3\3\3\3\3\3\0\0\0\0\0\0\0\0\200\340\360\60\30\30\30\30\30\60\360"
  "\340\200\0\0\0\77\377\340\200\0\0\0\0\0\200\340\377\77\0\0\0\0\0\31\31\37\17\17\33\33\31\31"
  "\14\14\0\0\30\30\370\370\30\30\30\30\30\60\360\340\0\0\0\0\0\0\377\377\14\14\14\34<\366\347\203"
  "\0\0\0\0\3\3\3\3\3\3\0\0\0\0\3\3\3\3\0\0\0\0\340\360\70\30\30\30\30\30\60\370"
  "\370\0\0\0\0\340\341\203\7\6\6\16\14\14\234\370\360\0\0\0\0\3\3\1\3\3\3\3\3\3\3\1"
  "\0\0\0\0\0\370\370\30\30\30\370\370\30\30\30\370\370\0\0\0\0\1\1\0\0\0\377\377\0\0\0\1"
  "\1\0\0\0\0\0\0\3\3\3\3\3\3\3\3\0\0\0\0\0\0\30\370\370\30\30\0\0\0\30\30\370"
  "\370\30\0\0\0\0\177\377\200\0\0\0\0\0\200\377\177\0\0\0\0\0\0\1\3\3\3\3\3\3\3\1"
  "\0\0\0\0\30x\370\230\30\0\0\0\0\30\230\370x\30\0\0\0\0\3\37|\340\200\200\340|\37\3"
  "\0\0\0\0\0\0\0\0\0\3\3\3\3\0\0\0\0\0\0\0\30\370\370\30\30\0\300\300\0\30\30\370"
  "\370\30\0\0\0\37\377\340\374\77\7\7\77\374\340\377\37\0\0\0\0\0\3\3\3\0\0\0\0\3\3\3"
  "\0\0\0\0\30\70x\370\330\230\0\0\230\330\370x\70\30\0\0\0\200\300\340q;\17\17;q\340\300"
  "\200\0\0\0\3\3\3\3\3\3\0\0\3\3\3\3\3\3\0\0\30\70x\370\330\30\0\0\30\330\370x"
  "\70\30\0\0\0\0\0\0\3\7\376\376\7\3\0\0\0\0\0\0\0\0\0\3\3\3\3\3\3\3\3\0"
  "\0\0\0\0\0\0\370\370\30\30\30\30\230\330\370x\70\0\0\0\0\0\200\300\340x<\16\7\3\0\340"
  "\340\0\0\0\0\0\3\3\3\3\3\3\3\3\3\3\3\0\0\0\0\0\0\0\0\0\374\374\14\14\14\0"
  "\0\0\0\0\0\0\0\0\0\0\377\377\0\0\0\0\0\0\0\0\0\0\0\0\0\0\77\77\60\60\60\0"
  "\0\0\0\0\0\0\6\36x\340\200\0\0\0\0\0\0\0\0\0\0\0\0\0\0\1\7\36x\340\200\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\1\7\36\30\0\0\0\0\0\0\14\14\14\374\374\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\377\377\0\0\0\0\0\0\0\0\0\0\0\60\60\60\77\77\0\0\0\0"
  "\0\0\0\0\0\0\0\0\300\360<<\360\300\0\0\0\0\0\0\0\0\0\3\3\0\0\0\0\3\3\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\60\60\60\60\60\60\60\60\60\60\60\60"
  "\60\60\60\0\0\0\0\0\10\30\60`@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\200\200\200\200\200\200\0\0\0"
  "\0\0\0\0\0\340\363\63\31\31\31\31\233\377\376\0\0\0\0\0\0\1\3\3\3\3\3\3\1\3\3\3"
  "\3\0\0\0\0\14\14\374\374\0\200\200\200\200\200\0\0\0\0\0\0\0\0\377\377\307\203\1\1\1\203\307"
  "\377|\0\0\0\3\3\3\3\1\3\3\3\3\3\1\1\0\0\0\0\0\0\0\200\200\200\200\200\200\0\200"
  "\200\0\0\0\0|\377\307\203\1\1\1\1\3\207\217\217\0\0\0\0\0\1\1\3\3\3\3\3\3\3\1"
  "\1\0\0\0\0\0\0\0\200\200\200\200\214\14\374\374\0\0\0\0\0|\377\307\203\1\1\1\203\307\377\377"
  "\0\0\0\0\0\0\1\1\3\3\3\3\3\1\3\3\3\3\0\0\0\0\0\0\200\200\200\200\200\200\0\0"
  "\0\0\0\0\0|\377\367\263\61\61\61\61\63\267\277\274\0\0\0\0\0\1\1\3\3\3\3\3\3\3\1"
  "\1\0\0\0\0\0\200\200\200\360\370\234\214\214\214\214\14\0\0\0\0\0\1\1\1\377\377\1\1\1\1\1"
  "\0\0\0\0\0\0\3\3\3\3\3\3\3\3\3\3\0\0\0\0\0\0\0\0\200\200\200\200\200\0\200\200"
  "\200\200\0\0\0|\377\307\203\1\1\1\203\307\377\377\1\1\0\0\0\0\1acccccq\77\37"
  "\0\0\0\0\14\14\374\374\0\200\200\200\200\200\0\0\0\0\0\0\0\0\377\377\7\3\1\1\1\3\377\376"
  "\0\0\0\0\3\3\3\3\3\3\0\0\3\3\3\3\3\3\0\0\0\0\0\200\200\234\234\234\0\0\0\0"
  "\0\0\0\0\0\0\0\1\1\1\377\377\0\0\0\0\0\0\0\0\0\0\3\3\3\3\3\3\3\3\3\3"
  "\0\0\0\0\0\0\200\200\200\200\234\234\234\200\0\0\0\0\0\0\0\0\1\1\1\1\1\1\377\377\0\0"
  "\0\0\0\0\0\0`````p\77\37\0\0\0\0\0\0\0\14\14\374\374\0\0\0\200\200\200\200"
  "\0\0\0\0\0\0\0\377\377\30<~\347\303\201\1\0\0\0\0\0\3\3\3\3\0\0\0\3\3\3\3"
  "\3\3\0\0\0\0\0\14\14\14\374\374\0\0\0\0\0\0\0\0\0\0\0\0\0\0\377\377\0\0\0\0"
  "\0\0\0\0\0\0\3\3\3\3\3\3\3\3\3\3\0\0\0\0\200\200\200\0\200\200\200\200\0\200\200\200"
  "\200\0\0\0\1\1\377\377\3\1\1\377\377\3\1\1\377\377\0\0\3\3\3\3\3\0\0\3\3\3\3\0"
  "\3\3\3\3\200\200\200\200\0\0\200\200\200\200\0\0\0\0\0\0\1\1\377\377\6\3\1\1\1\3\377\376"
  "\0\0\0\0\3\3\3\3\3\3\0\0\3\3\3\3\3\3\0\0\0\0\0\0\200\200\200\200\200\200\0\0"
  "\0\0\0\0\0|\377\307\203\1\1\1\1\203\307\377|\0\0\0\0\0\1\1\3\3\3\3\3\3\1\1"
  "\0\0\0\0\200\200\200\200\0\200\200\200\200\200\0\0\0\0\0\0\1\1\377\377\307\203\1\1\1\203\307\377"
  "|\0\0\0``\177\177acc\3\3\3\1\1\0\0\0\0\0\0\0\0\200\200\200\200\200\0\200\200"
  "\200\200\0\0\0|\377\307\203\1\1\1\203\307\377\377\1\1\0\0\0\0\1\1\3\3\3cca\177\177"
  "``\0\0\0\0\200\200\200\200\0\0\200\200\200\200\0\0\0\0\0\0\1\1\377\377\7\3\1\1\1\3"
  "\3\0\0\0\0\3\3\3\3\3\3\3\3\3\3\0\0\0\0\0\0\0\0\0\200\200\200\200\200\0\200\200"
  "\0\0\0\0\0\0\306\317\217\31\31\71\61\63\347\347\300\0\0\0\0\0\3\3\1\3\3\3\3\3\3\1"
  "\0\0\0\0\0\200\200\370\370\200\200\200\200\200\200\0\0\0\0\0\0\1\1\377\377\201\1\1\1\201\201\200"
  "\0\0\0\0\0\0\0\0\1\3\3\3\3\3\1\1\0\0\0\0\200\200\200\200\0\0\0\0\200\200\200\200"
  "\0\0\0\0\1\1\377\377\200\0\0\0\1\201\377\377\0\0\0\0\0\0\0\1\3\3\3\3\3\1\3\3"
  "\3\3\0\0\200\200\200\200\200\200\0\0\200\200\200\200\200\200\0\0\1\1\7\37y\341\200\200\341y\37\7"
  "\1\1\0\0\0\0\0\0\0\1\3\3\1\0\0\0\0\0\0\0\200\200\200\200\200\0\0\0\0\200\200\200"
  "\200\200\0\0\1\7\177\371\301\360>>\360\301\371\177\7\1\0\0\0\0\0\3\3\0\0\0\0\3\3\0"
  "\0\0\0\0\0\200\200\200\200\200\0\0\200\200\200\200\200\0\0\0\0\1\1\203\307m\70\70m\307\203\1"
  "\1\0\0\0\0\3\3\3\3\3\0\0\3\3\3\3\3\0\0\0\0\200\200\200\200\200\0\0\200\200\200\200"
  "\200\0\0\0\0\1\7\37}\361\200\300\361}\37\7\1\0\0\0\0```p}\177g\1\0\0\0"
  "\0\0\0\0\0\0\200\200\200\200\200\200\200\200\200\200\0\0\0\0\0\0\207\307\341q\71\35\17\7\303\301"
  "\0\0\0\0\0\0\3\3\3\3\3\3\3\3\3\3\0\0\0\0\0\0\0\0\0\0\360\370\14\4\4\0"
  "\0\0\0\0\0\0\0\0\10\34\377\367\0\0\0\0\0\0\0\0\0\0\0\0\0\0\17\37\60  \0"
  "\0\0\0\0\0\0\0\0\0\0\374\374\0\0\0\0\0\0\0\0\0\0\0\0\0\0\377\377\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\17\17\0\0\0\0\0\0\0\0\0\0\0\4\4\14\370\360\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\367\377\34\10\0\0\0\0\0\0\0\0\0  \60\37\17\0\0\0\0"
  "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\30\34\16\6\6\16\34\30\30\34\16"
  "\6\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0";
